---
kind: other
id: Methods.T:Autodesk.Revit.UI.Events.DialogBoxData
source: html/eb2e910e-24a5-6160-4cbf-998602489e62.htm
---
# DialogBoxData Methods

Causes the object to release immediately any resources it may be utilizing.